
let simpleWords = mix(['ПА-ПА', 'МА-МА', 'КА-ША', 'НЕ-БО', 'РЫ-БА', 'РУ-КА', 'БЕ-ДА', 'ВО-ДА', 'ГУ-СИ', 'ДЕ-ЛО', 'ЖЕ-ЛЕ', 'ЗИ-МА', 'КУ-РЫ', 'ЛЕ-ТО', 'МУ-ХА', 'ПЕНЬ', 'НО-РА', 'ЛА-ПА', 'КО-ЗА', 'ВЕ-СЫ', 'ГУ-БА', 'МО-РЕ', 'ЧУ-ДО', 'ПО-ЛЕ', 'ПИ-ЛА', 'ЛУ-ЖА', 'ЛУ-ЧИ', 'НО-ГИ', 'РЕ-КА', 'ЛЕНЬ', 'ШУ-БА', 'ША-РЫ', 'ЧА-СЫ', 'ПЕНЬ', 'БУ-СЫ', 'РО-ЗА', 'ЖА-БА', 'ЛЫ-ЖИ', 'БУ-РЯ', 'СИ-ЛА', 'ВА-ТА', 'ЛИ-СА', 'ВА-ЗА', 'СО-ВА', 'ПЕ-НА', 'КИ-НО', 'ЗА-РЯ', 'ЛА-ПА', 'ЖА-РА', 'ГО-РА', 'ТИ-НА', 'СА-ЖА', 'БА-НЯ', 'ДЕ-ТИ', 'ЛУ-НА', 'РА-МА', 'ДЮ-НА', 'МЫ-ЛО', 'КО-СА', 'РО-СА', 'ПЕ-РО', 'ПО-РА', 'ТЕ-ЛО', 'СЕ-РА', 'МЕ-РА', 'ВЕ-РА', 'ЦЕ-НА', 'СЕ-ЛО', 'ПИ-ЛА', 'ШИ-НА', 'Ю-ЛА', 'ДЕНЬ', 'СЫН', 'О-КО', 'СЫПЬ', 'КОТ', 'КО-ЖА', 'ШЕ-Я']);

let middleWords = mix(['ЯХ-ТА', 'О-СЕНЬ', 'ДО-РО-ГА', 'КУ-ПОЛ', 'МА-ЯК', 'СИ-НИ-ЦА', 'ИГ-ЛА', 'О-БЕД', 'ЗА-ЯЦ', 'ТРОС', 'ИГ-РА', 'КО-ЛЕ-СО', 'ВО-ИН', 'ВО-РО-НА', 'КАП-ЛЯ', 'И-ЗЮМ', 'СО-БА-КА', 'ЮН-ГА', 'И-КО-НА', 'БА-ЯН', 'АР-КА', 'СРОК', 'СТА-Я', 'ПО-РОХ', 'ТРОН', 'КА-ТОК', 'СО-ЮЗ', 'НОЛЬ', 'ПО-ЛЕ-НО', 'АИСТ', 'У-ЖИН', 'КОРОВА', 'СО-РО-КА', 'ДУ-БИ-НА', 'ОВ-ЦА', 'ГУ-ДОК', 'И-ЮНЬ', 'КУ-ПОН', 'САН-КИ', 'КА-БАН', 'У-ДАР', 'У-ДАВ', 'КРОТ', 'УТ-РО', 'МА-ЛЫШ', 'У-ТЮГ', 'УТ-КА', 'Ю-МОР', 'Я-ЩИК', 'О-БОД', 'У-БОР', 'ЗУБР', 'У-ЗЕЛ', 'ШВЕ-Я', 'У-ЖАС', 'БЕ-РЕГ', 'Э-ТАЖ', 'КРЮК', 'ДО-ЛИ-НА', 'МО-РОЗ', 'Е-НОТ', 'Ё-ЖИК', 'МА-ЛИ-НА', 'ЕС-ЛИ', 'ЗМЕ-Я', 'ТУ-МАН', 'ЁЛ-КА', 'КРУГ', 'МО-ТОР', 'ИК-РА', 'ПО-РОГ', 'Я-ЩЕР', 'КО-ЛЕ-НО', 'И-ЮЛЬ', 'И-ТОГ', 'СА-ЛАТ', 'ЩУ-КА', 'Э-ФИР', 'БЕ-РЁ-ЗА', 'ГА-ЗОН', 'КРАН', 'ДО-МИ-НО', 'ТРУ-БА', 'ГА-ЗЕ-ТА', 'О-ЖОГ', 'КРЫ-ЛО', 'О-РЕХ', 'ШОР-ТЫ', 'ЛОД-КА', 'КО-РО-НА', 'ЮБ-КА', 'ДА-ЛЕ-КО', 'ПАП-КА', 'СТОП', 'МО-ЛО-КО', 'ЮР-ТА', 'Я-ЗЫК', 'О-РЁЛ', 'МА-ШИ-НА', 'НОЧЬ', 'ЯД-РО', 'ЯЙ-ЦО', 'ПО-РО-ШОК', 'ВА-ГОН', 'О-ГУ-РЕЦ', 'БУ-КЕТ', 'ОЧ-КИ', 'ОК-НО', 'И-НЕЙ', 'ЖА-ДИ-НА', 'ВНУК', 'ДВЕРЬ', 'А-ЛЫЙ', 'СО-УС', 'И-ШАК', 'НО-МЕР', 'О-СЁЛ', 'О-ВЁС', 'ХУ-ТОР', 'ГРО-ЗА', 'ТРЯП-КА', 'ГО-РОД', 'О-ГО-РОД', 'ЗА-НО-ЗА', 'ТРО-ПА', 'СТАВ-КА', 'МАС-ЛО', 'ГРИБ', 'КУК-ЛА', 'КОШ-КА', 'ДОК-ТОР', 'ПТИ-ЦА', 'ПАРК', 'ШТО-РА', 'АБ-ЗАЦ', 'ПЛЯЖ', 'КЛЕТ-КА', 'ЛИ-НИ-Я', 'ЛИ-ЛИ-Я', 'ПЮ-РЕ', 'БО-ЛО-ТО', 'ЗВЕРЬ', 'ВО-ЖАК', 'ХИ-ЖИ-НА', 'МЕЧ-ТА', 'СКАЗ-КА', 'ПА-МЯТЬ']);

let complexWords = mix(['НА-КЛОН', 'НОС-КИ', 'НИТ-КА', 'НЕК-ТАР', 'СТАРТ', 'ПО-КЛОН', 'ГО-ЛУБЬ', 'СКРОМ-НО', 'СКРЫТ-НО', 'СКАЧ-КА', 'СХВАТ-КА', 'СКРЕП-КА', 'ВПРОК', 'СТРО-КА', 'ВЕР-СТА', 'СТРЕ-ЛЕЦ', 'НА-ВОД-НЕ-НИ-Е', 'НО-СО-РОГ', 'СТРЮ-ЧОК', 'СТРОЙ', 'ДРОЗД', 'ПЫ-ЛЕ-СОС', 'ТРОСТ-НИК', 'СТРУ-Я', 'ТРО-ПИН-КА', 'СТЕЛЬ-КА', 'СКЛАД-КА', 'А-НАС-ТА-СИ-Я', 'СТРЕЛ-КА', 'СПРАВ-КА', 'ВСТАВ-КА', 'ПА-ДЕ-НИ-Е', 'СНЕ-ЖИН-КА', 'КРУ-ПИН-КА', 'И-ЗЮ-МИН-КА', 'ВЫ-ДУМ-КА', 'ПРО-ВОД-КА', 'КОР-ЗИ-НА', 'ПА-У-ТИ-НА', 'СТРАХ', 'МО-РО-ЖЕ-НО-Е', 'СЧА-СТЬЕ', 'АВ-ТО-БУС', 'ГНЕЗ-ДО', 'СКВЕР', 'ПА-ЛОЧ-КА', 'ША-ПОЧ-КА', 'СТРИЖ-КА', 'ПОДЪ-ЕЗД', 'А-У-ДИ-О', 'ОБЪ-ЯВ-ЛЕ-НИ-Е', 'ШКВАЛ', 'СТЯЖ-КА', 'ВАР-ВА-РА', 'БРЕ-ЛОК', 'ПРАЗД-НИК', 'РОЖ-ДЕ-НИ-Е', 'ЗАТ-МЕ-НИ-Е', 'ПЛАТЬ-Е', 'ЧУВ-СТВО', 'СЕРД-ЦЕ', 'ЖИ-ВОТ-НО-Е', 'КРО-ПИ-ВА', 'Е-ЖЕ-ВИ-КА', 'ЧТЕ-НИ-Е', 'ГРЕБ-ЛЯ', 'ПРА-ВИЛЬ-НО', 'БЫ-СТРО-ТА', 'СКО-РОСТЬ', 'КУ-СТАР-НИК', 'ПРО-ЕКТ', 'ЭК-СПЕРТ', 'СТИ-ХО-ТВО-РЕ-НИ-Е', 'СТУ-ПЕНЬ-КА', 'АВ-ТО-МО-БИЛЬ', 'ВИ-ДЕ-О', 'СТРЕ-КО-ЗА', 'БИБ-ЛИ-О-ТЕ-КА', 'БА-БОЧ-КА', 'МО-СТО-ВАЯ', 'АЛЬ-БОМ', 'МОР-КОВ-КА', 'ТРУД-НОСТЬ', 'О-ШИБ-КА', 'БУК-ВАРЬ', 'СВИ-ДА-НИ-Е', 'БУ-ТЫЛ-КА', 'ЗДРАВ-СТВУЙ-ТЕ', 'ТРЕ-НА-ЖЁР']);

let syllableDivision = document.getElementById('syllableDivision');

let isWithDivision = true;

let index = 0;
let activeArray = simpleWords;

showWord(activeArray);

selectComplexity.onchange = function() {

    index = 0;
    switch (selectComplexity.value) {
        case 'simple':
            activeArray = mix(simpleWords);            
            break;
        case 'middle':
            activeArray = mix(middleWords);            
            break;
        case 'complex':
            activeArray = mix(complexWords);            
            break;
        case 'different':
            activeArray = mix(simpleWords.concat(middleWords).concat(complexWords));
    } 
    console.log(activeArray);
    showWord(activeArray);
};

syllableDivision.onclick = function() {
    
    syllableDivision.classList.toggle('active');
    showWord(activeArray);
}

okButton.onclick = function() {
    
    if (index == activeArray.length - 1) {
        activeArray = mix(activeArray);
        index = 0;        
    } else {
        index ++;
    }

    showWord(activeArray);

    if(timer) counter ++;
};

prevButton.onclick = function() {

    if (index == 0) {
        showWord(activeArray);
        return;
    }

    index --;
    showWord(activeArray);

}

selectTime.onchange = onSelectTime;

skipButton.onclick = function() {

    if (index == activeArray.length - 1) {
        activeArray = mix(activeArray);
        index = 0;
    } else {
        index ++;
    }

    showWord(activeArray);
};

stopButton.onclick = cancelStopwatch;

function showWord(array) {    
    
    if (!syllableDivision.classList.contains('active')) {
        let newWord = '';
        for (let l of array[index]){
            if (l == '-') continue;
            newWord += l;
        }

        main.innerHTML = newWord;            
        } else {
            main.innerHTML = array[index];
        }
    }
    

    function defineLastWordOfMessage(counter) {
        if (counter > 10 && counter < 20)  return 'слов';
        
        let lastNumber = counter % 10;
    
        if(lastNumber == 0) return 'слов';
    
        if (lastNumber == 1) return 'слово';
    
        if (lastNumber >= 2 && lastNumber <= 4) return 'слова';
    
        if (lastNumber >= 5 && lastNumber <= 9) return 'слов';
    }