let simpleTexts = mix(['Зима. На улице и во дворе много снега. Дети гуляют во дворе. Они лепят бабу из снега. У Пети озябли руки. Он взял снега и натёр им руки. Руки от снега согрелись.', 'Дети пошли в лес за грибами. Лена нашла четыре гриба. Вера нашла два гриба под ёлкой. Ваня нашёл пять грибов под берёзой. Дети устали. Они сели под ёлку и пели песни.', 'Была у бабушки корова Рыжуха. Лиза и Галя пасли Рыжуху на лугу. Тут был и Бобик. Рыжуха ела траву, а Бобик спал. Лиза и Галя рвали маки.', 'Настала осень. День стал меньше. Берёза, тополь и ясень стоят голые. Все листики упали. Весь день идёт дождь. Гулять нельзя. Юра взял краски и стал рисовать. Папа подарил Юре хороший альбом для рисования.','Была у Бори собака Шарик. Идёт Боря в школу, а Шарик за ним бежит. Боря в школе сидит, учится, а Шарик на дворе лежит, ждёт Борю. Идут дети из школы, и Шарик бежит с ними, лает. Шарик не отстаёт от Бори.', 'День был ясный и тёплый. Юра и Сеня пошли гулять. Вот и речка. За речкой лес. Там есть большой пень. Мальчики сели на этот пень. Тихо в лесу. Только ёжик шуршит в траве.', 'У школы гора. Весь день на горе много детей. Вот Митя и собака Пушок сели на санки. Санки быстро едут с горы. Пушку страшно, а Мите весело.', 'В лесу живут медведи, волки, зайцы, белки и лисы. Белка прыгает по веткам. Зайка сидит под кустом. Медведь делает берлогу и спит там всю зиму. Волк бродит по лесу голодный. Лиса ловит зайцев и ворон.', 'Было много снегу. Ваня и Катя пошли на двор. У Вани были лыжи, а у Кати были сани. На дворе была горка. Ваня на лыжах, а Катя на санках едут с горки.', 'Миша идёт в школу. В руках у Миши сумка. Там книги и тетради. Вот и школа. Миша снимает шубу и шапку. Скоро звонок. Миша идёт на урок.', 'Наш лес большой. В лесу растут ели, сосны, дубы, липы, берёзы. В лесу гуляют дети. Они ищут грибы. Боря и Андрюша нашли два рыжика, много маслят. Юра и Яша нашли в лесу ёжика. Они положили ёжика в шапку и принесли домой. Ёжик уколол Юру, но Юра не плакал.', 'Пришли дети домой из леса и принесли домой ежа. Кошка Мурка цап его лапой. Ёж быстро спрятал голову и выставил свои острые иголки. Уколола кошка лапу и ушла в угол. Мурка стала лизать лапу, а на ежа не смотрела.', 'Был у Мити зайка. Он был ручной. Зайка любил прыгать. Митя забыл закрыть клетку. Прыгнул зайчик в садик. Стал Митя зайку искать. Искал, искал, а зайка сидит под кустом. Митя снова унёс зайку домой.', 'Утром отец уехал в город. Дети ждали его. Из города отец приехал вечером. Он купил в городе чай, сахар, крупу, мыло. Детям отец купил подарки. Коле отец купил барабан. Кате купил куклу, а Диме книгу. Дети были рады подаркам.', 'Жил у нас кот. Звали кота Дымка. Был он гладкий, хвост пушистый. Хорошо умел Дымка мышей ловить. Чуть зашуршит в углу - Дымка уж там. Чует кот добычу. Часто ловил Дымка глупых мышат себе на ужин.', 'Утро было тёплое. Пчёлы проснулись рано и полетели в поле. Цветов было много: тут и лютики, и ромашки, и незабудки. Цветёт душистая липа. Много пчёл летает около липы. Всё лето трудятся пчелы. Много мёду получаем мы от пчёл.', 'Мама ушла на работу. Катя и Варя были дома. Они решили убрать комнату. Катя взяла тряпку и ведро с водой. Она чисто мыла пол. Варя вытирала пыль со шкафа, со стульев. Потом Катя и Варя мыли посуду. Когда пришла мама, всё было чисто.', 'На ёлке детям подарили много игрушек. Кирюша получил юлу. Лиза получила большую куклу. Ваня был очень рад барабану. Малыши Вова и Миша получили кубики. Они тут же стали строить из них дом. Ребята дружно играли новыми игрушками.', 'На ферме большой птичий двор. На дворе гуляют гуси и гусята, утки и утята, куры и цыплята. Птиц кормит птичница бабушка Настя. Ей помогают Таня и Катя. Они кормят гусят, утят и цыплят.', 'За нашим домом есть сад. В саду растут яблони, груши, сливы и вишни. Есть кусты малины. На грядках растёт клубника. Перед домом клумбы с цветами. На клумбах цветут розы, лилии, пионы, анютины глазки.', 'Хотела галка пить. На дворе стоял кувшин с водой. Но воды было мало. Галка не могла достать. Она стала кидать в кувшин камешки. Умная птица столько накидала, что вода стала выше. Вот так галка!', 'Яша поймал большую щуку. Он пустил щуку  таз с водой. Учуядл добычу рыжий кот Пират. Хотел кот поймаь щуку. Только у щуки зубы острые. Щука цапнула кота за лапу. Долго помнил кот эту встречу!', 'Боря, Юра и Таня ходили в лес за грибами. Дети набрали полные корзинки грибов. Вышли на полянку и сели отдохнуть. Но вот надвинулись тучи. Блеснула молния, загмел гром. Ребята схватили корзинки бегут домой. Надо успеть до дождя!']);


let complexTexts = mix(['Было лето. Юра и Яша шли по берегу озера. Вдруг из-за куста вылетела утка. Юра и Яша подошли к кусту. Из-под куста выбежали маленькие утята и побежали к матери. Они ещё не умели летать. Мальчики стали смотреть, что будет дальше. Утка спустилась в воду и поплыла. Она крякала и звала утят. Утята один за другим спустились в воду. Они поплыли за уткой.', 'Дядя Семён ехал из города домой. С ним была собака Жучка. Вдруг из леса выскочили волки. Жучка испугалась и прыгнула в сани. У дяди Семёна была хорошая лошадь. Она тоже испугалась и быстро помчалась по дороге. Деревня была близко. Показались огни в окнах. Волки отстали. Умная лошадь спасла дядю Семена и Жучку.', 'Лев и медведь добыли мясо и стали за него драться. Медведь не хотел уступить, и лев не уступал. Они так долго бились, что ослабели оба и легли. Лисица увидала их мясо, подхватила его и убежала.', 'Светило яркое солнышко. Под сосной у реки была барсучья нора. У норы сидел барсук. Вот зверек издал слабый звук. Из темной норы стали выползать барсучата. Малыши были маленькие и жирные. Барсучата стали играть. Они перекатывались с боку на бок по сырой земле. Маленький барсучонок был самый веселый.', 'На высокой скале паслись олени. В тени лежал маленький оленёнок. Орёл высмотрел оленёнка и босился на него. Мать услышала шум крыльев громадной птицы. Олениха встала на задние ноги около детёныша. Передними копытами она старалась ударить орла. Орёл отступил. Он полетел к своему гнезду.', 'У кошки Клары родились котята. Через неделю у них открылись глазки и стали резаться зубки. Малыши первый раз выбрались из корзинки. Один залез под шкаф, другой залез под кровать. Под кроватью стояли красные сапожки Лизы. Пушистый котёнок залез в сапог и крепко уснул в нём.', 'За нашим двором есть большая горка. Подъём на горку покрыт льдом. Каждый день бегут туда ребятишки с санками. С утра до вечера стоит на горке шум. Страшно ехать только первый раз. Вот мальчики сели на санки все вместе и помчались стрелой. А Костя съехал на коньках. С лаем бежит за ним Жучка. А шалунья Катя с горки скатилась и в сургоб свалилась.', 'Одуванчик похож на солнышко с золотыми лучами. А рядом белеет пушистый шарик. Таня дунула на шарик. Полетели пушинки. Потому и называется одуванчик. Танюша пришла домой с золотым веночком на голове. Вечером уснула девочка. И одуванчики закрыли свои цветочки до утра.', 'Галку и ворону различить совсем не трудно. Галка вдвое меньше вороны и вся черная, только вокруг шеи серые перышки, будто она серым платочком повязана. А у вороны наоборот: все туловище серое, черные только голова, шея, крылья да хвост.', 'Сорока любит блестящие вещи. Все, что блестит, сорока тащит в своё гнездо. Увидит сорока кусочек стекла - унесёт к себе. Увидит серебряную монету - тоже возьмёт. Раз мама варила в саду варенье. Она положила на стол серебряную ложку. Как только мама отвернулась, сорока подлетела и схватила серебряную ложку. Маленький Сеня увидел это и закричал. Сорока испугалась и выпустила ложку.', 'Долго сидел я с удочкой на берегу. Не клюют у меня пескари. А дед под кустиком сидит и уже ведерко наловил. Сел и я в тени. Сразу пескари клевать стали. Оказывается, на чистом месте тень от удочки видна. Вот и не шла к крючку хитрая рыба.', 'Ваня ходит в школу. Из школы он спешит домой. Дома Ваню ждет большая работа. Он носит дрова, топит печку. Надо принести воды, напоить козу и овцу. К Ване приходят товарищи и помогают ему сделать всю работу. Потом мальчики вместе учат уроки.']);

let activeArray = simpleTexts;
index = 0;

let start;

let amountOfWords, speed;

showText();

selectComplexity.onchange = function() {

    if(this.value == 'simple') {
        activeArray = mix(simpleTexts);
    } else {
        activeArray = mix(complexTexts);
    }
     index = 0;
     showText();
}

okButton.onclick = function() {
    
    if (selectTime.classList.contains('active')) {
        stopStopwatch(timerID);
        console.log(amountOfWords)
        let time = (new Date - start) / 1000;
        speed = Math.round(amountOfWords / time) * 60; 
        showMessage('Поздравляю!', `Скорость чтения - ${speed} слов в минуту.`);
        selectTime.classList.toggle('active');
        okButton.innerHTML = '▶';
        okButton.style.color = 'white';
        return;
    }

    if(index == activeArray.length - 1) {
        index = 0;
    } else {
        index ++;
    }
    showText();
};

prevButton.onclick = function() {

    if (index > 0) {
        index --;
    }

    showText();
};

selectTime.onclick = function() {
    let dialogWindow = document.createElement('div');
    dialogWindow.className = 'startWindow';
    dialogWindow.insertAdjacentHTML('afterbegin','<button id="startButton" class="button ok">Старт</button><button id="cancelButton" class = "button cancel">Отмена</button>');
    area.append(dialogWindow);

    startButton = document.getElementById('startButton');
    cancelButton = document.getElementById('cancelButton');

    startButton.onclick = function() {
        dialogWindow.remove();
        start = new Date();
    prevButton.hidden = true;
    selectTime.classList.toggle('active');
    okButton.innerHTML = '✔';
    okButton.style.color = '#ffde59';   
    amountOfWords = countWords(activeArray[index]);

    runStopwatch();
    }

    cancelButton.onclick = function() {
        dialogWindow.remove();
        selectTime.value = 'notSelected';  
    }    

};

selectTime.onselectstart = function() {
    return false;
}

stopButton.onclick = function() {
    stopStopwatch(timerID);
    selectTime.classList.toggle('active');    
    okButton.style.color = 'white';
    okButton.innerHTML = '▶';
    
    
} 

function showText() {
    main.innerHTML = activeArray[index];
}

function countWords(str) {

    //amount of words is one more than amount of spaces
    let a = 1;
    for (let symb of str) {
        if (symb == ' ') {
            a ++;
        }
    }

    return a;
}

